<body style="background-image: url(workbook.png);">
<h2><center>El mundo de Karel</center></h2>
Karel puede orientarse en una de las cuatro direcciones: Este, Oeste, Norte y Sur. S&oacute;lo gira 90&deg; cada vez, por tanto no puede orientarse hacia en NordEste, por ejemplo. En el mundo de Karel, las calles
 van de Este a Oeste, y son numeradas comenzando por 1. No hay n&uacute;meros de calle igual a 0 o negativos. Las avenidas van de Norte a Sur, y tambi&eacute;n est&aacute;n numeradas empezando por 1. Tampoco hay n&uacute;meros de
 avenida igual a 0 o negativos. Se le llama esquina a la intersecci&oacute;n de una calle con una avenida. Karel va de una esquina a la siguiente en un solo movimiento. Ejecuta el programa Karel.exe de la 
 carpeta KarelOMI. Se iniciar&aacute; el simulador del Robot. Ahora deber&iacute;as ver la ventana de abajo. 
<center><img src="image010.png" /></center>
<p>Esta ventana muestra las calles y avenidas que usa Karel para desplazarse. Primero debemos inicializar (o crear) el mundo que Karel va a ocupar. La idea es que puedas introducir algunos elementos en el
mundo inicial de Karel.</p>
<p>Puedes colocar y quitar muros en el Norte, Sur, Este u Oeste del cursor dando click con el bot&oacute;n izquierdo del rat&oacute;n en la intersecci&oacute;n de las calles correspondientes. Los muros que
limitan las calles y avenidas no se pueden quitar, &eacute;stos son los que previenen que Karel se salga del mundo. <b>Prueba a introducir algunos muros para ver que aspecto tienen.</b></p>
<p>Otro elemento de inter&eacute;s en el mundo de Karel son los zumbadores. Un zumbador es una forma de marca que Karel puede escuchar sólo cuando se encuentra en la misma esquina que el zumbador. Karel tiene una
mochila que puede utilizar para poner los zumbadores que vaya cogiendo. Tambi&eacute;n puede hacer lo contrario, es decir, sacar los zumbadores de su mochila y depositarlos en las esquinas por las que va 
pasando. Puedes ajustar el número inicial de zumbadores en cada esquina dando click con el bot&oacute;n izquierdo del rat&oacute;n en la calle deseada y escribiendo n&uacute;mero de zumbadores 
deseados (entre 0 y 999 zumbadores).</p>
<p>Prueba a poner algunos zumbadores para ver como se visualizan en el mundo. Crea el mundo inicial que se muestra a continuaci&oacute;n.
Dado que hemos realizado todo el trabajo necesario para crear un mundo para Karel, ¡vamos a guardarlo !  Pulsa sobre el botón Guardar, ve a tu directorio particular y guarda el mundo como 
NuevoMundo.mdo</p>
<center><img src="image012.png"/></center>
<p>Finalmente, &#33;Karel tiene su sitio en el mundo! Mueve el cursor del rat&oacute;n hacia la esquina de la Avenida 15 y Calle 1 y da click con el bot&oacute;n derecho del mouse, y karel se movera, sigue
presionando el bot&oacute;n derecho en la misma posici&oacute;n para orientar a karel hacia el oeste. Ahora deber&iacute;as visualizar el mundo de abajo.  Haz de nuevo click sobre el bot&oacute;n  "Guardar" , 
para almacenar los cambios.</p>
<center><img src="image014.png"/></center>
<h2><center>
   <p>El mundo de Karel </p>
   <a href="Karel.htm">Regresar</a>
</center></h2>
</body>
